# PART 1

### 3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
Prepared_data_frame = pd.read_pickle('/Users/yukbuinnemtat/Desktop/30-07-2023 Instacart Basket Analysis/Prepared Data/prepared_dataframe.pkl')

In [3]:
path = r'/Users/yukbuinnemtat/Desktop/30-07-2023 Instacart Basket Analysis'

In [4]:
customer_data = pd.read_csv('/Users/yukbuinnemtat/Desktop/30-07-2023 Instacart Basket Analysis/02 Data/Original Data/customers.csv')

### 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [5]:
# Rename columns with illogical names

customer_data.rename(columns={'Surnam': 'Last Name'}, inplace=True)

In [6]:
# Rename columns with illogical names

customer_data.rename(columns={'fam_status': 'Marital_status'}, inplace=True)

In [7]:
customer_data.rename(columns={'n_dependants': 'Number_of_dependants'}, inplace=True)

In [8]:
customer_data.rename(columns={'STATE': 'State'}, inplace=True)

In [9]:
customer_data.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,Number_of_dependants,Marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
Prepared_data_frame.head()

,order_id,user_id,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,spending_flag,order_frequency_flag
0,2539329,1,2,8,NaN,196,1,0,Soda,77,7,9.0,10,Loyal Customer,Low spender,Non-frequent customer
1,2398795,1,3,7,15.0,196,1,1,Soda,77,7,9.0,10,Loyal Customer,Low spender,Non-frequent customer
2,473747,1,3,12,21.0,196,1,1,Soda,77,7,9.0,10,Loyal Customer,Low spender,Non-frequent customer
3,2254736,1,4,7,29.0,196,1,1,Soda,77,7,9.0,10,Loyal Customer,Low spender,Non-frequent customer
4,431534,1,4,15,28.0,196,1,1,Soda,77,7,9.0,10,Loyal Customer,Low spender,Non-frequent customer

In [11]:
# Create a subset of NaN values in the 'first' column

df_NaN = customer_data[customer_data['First Name'].isnull() == True]

In [12]:
df_NaN

,user_id,First Name,Last Name,Gender,State,Age,date_joined,Number_of_dependants,Marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [13]:
# Present customer_data shape

customer_data.shape

(206209, 10)

In [14]:
# Dropping the NaN values from the 'First Name' column

customer_data_clean = customer_data[customer_data['First Name'].isnull() == False]

In [15]:
# Recent customer_data shape after dropping NaN values in 'First Name'

customer_data_clean.shape

(194950, 10)

In [17]:
# Checking the basic information of customers_data_clean

customer_data_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 194950 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               194950 non-null  int64
 1   First Name            194950 non-null  object
 2   Last Name             194950 non-null  object
 3   Gender                194950 non-null  object
 4   State                 194950 non-null  object
 5   Age                   194950 non-null  int64
 6   date_joined           194950 non-null  object
 7   Number_of_dependants  194950 non-null  int64
 8   Marital_status        194950 non-null  object
 9   income                194950 non-null  int64
dtypes: int64(4), object(6)
memory usage: 16.4+ MB

### 5. Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [18]:
# Check for missing values

customer_data_clean.isnull().sum()

user_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
date_joined             0
Number_of_dependants    0
Marital_status          0
income                  0
dtype: int64

In [19]:
# Double checking missing values in 'First Name' column

customer_data_clean['First Name'].value_counts(dropna = False)

Marilyn    2213
Barbara    2154
Todd       2113
Jeremy     2104
Cynthia    1951
           ...
Merry       197
Eugene      197
Garry       191
Ned         186
David       186
Name: First Name, Length: 207, dtype: int64

In [20]:
# Remove duplicates

customer_data_clean.drop_duplicates(inplace=True)

/tmp/ipykernel_27462/616660683.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customer_data_clean.drop_duplicates(inplace=True)

In [21]:
# Removing duplicates

customer_data_clean_copy = customer_data_clean.copy()

In [22]:
# Removing duplicates

customer_data_clean_copy.drop_duplicates(inplace=True)

In [30]:
print(customer_data_clean_copy)

        user_id First Name Last Name  Gender           State  Age date_joined  \
0         26711    Deborah  Esquivel  Female        Missouri   48    1/1/2017
1         33890   Patricia      Hart  Female      New Mexico   36    1/1/2017
2         65803    Kenneth    Farley    Male           Idaho   35    1/1/2017
3        125935   Michelle     Hicks  Female            Iowa   40    1/1/2017
4        130797        Ann   Gilmore  Female        Maryland   26    1/1/2017
...         ...        ...       ...     ...             ...  ...         ...
206204   168073       Lisa      Case  Female  North Carolina   44    4/1/2020
206205    49635     Jeremy   Robbins    Male          Hawaii   62    4/1/2020
206206   135902      Doris  Richmond  Female        Missouri   66    4/1/2020
206207    81095       Rose   Rollins  Female      California   27    4/1/2020
206208    80148    Cynthia     Noble  Female        New York   55    4/1/2020

        Number_of_dependants Marital_status  income
0                          3        married  165665
1                          0         single   59285
2                          2        married   99568
3                          0         single   42049
4                          1        married   40374
...                      ...            ...     ...
206204                     1        married  148828
206205                     3        married  168639
206206                     2        married   53374
206207                     1        married   99799
206208                     1        married   57095

[194950 rows x 10 columns]

#### No duplicates checked

In [31]:
# Check for mixed-types in customer_data_clean_copy

for col in customer_data_clean_copy.columns:
    weird = (customer_data_clean_copy[[col]].applymap(type) != customer_data_clean_copy[[col]].iloc[0].apply(type)).any(axis=1)
    if len(customer_data_clean_copy[weird]) > 0:
        print(col)

#### No mixed-type data confirmed

In [32]:
# To check the data types of each column.

customer_data_clean_copy.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
date_joined             object
Number_of_dependants     int64
Marital_status          object
income                   int64
dtype: object

In [33]:
# To check the data types of each column.

Prepared_data_frame.dtypes

order_id                    int64
user_id                     int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
max_order                   int64
loyalty_flag               object
spending_flag              object
order_frequency_flag       object
dtype: object

In [34]:
# Checking Prepared_data_frame info

Prepared_data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 16 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   orders_day_of_week      int64
 3   order_hour_of_day       int64
 4   days_since_prior_order  float64
 5   product_id              int64
 6   add_to_cart_order       int64
 7   reordered               int64
 8   product_name            object
 9   aisle_id                int64
 10  department_id           int64
 11  prices                  float64
 12  max_order               int64
 13  loyalty_flag            object
 14  spending_flag           object
 15  order_frequency_flag    object
dtypes: float64(2), int64(10), object(4)
memory usage: 3.9+ GB

### 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [35]:
# Combining customer_data_clean_copy to Prepared_data_frame using the user_id column as intermediary

combined_data_new = Prepared_data_frame.merge(customer_data_clean_copy, on = 'user_id')

In [36]:
# Overview of first 5 rows of the newly merged data

combined_data_new.head()

,order_id,user_id,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,...,order_frequency_flag,First Name,Last Name,Gender,State,Age,date_joined,Number_of_dependants,Marital_status,income
0,2539329,1,2,8,NaN,196,1,0,Soda,77,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,3,7,15.0,196,1,1,Soda,77,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,12,21.0,196,1,1,Soda,77,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,7,29.0,196,1,1,Soda,77,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,4,15,28.0,196,1,1,Soda,77,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [37]:
# checking size of the newly merged data

combined_data_new.shape

(30657347, 25)

### 7. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [38]:
# Exporting newly merged dataframe to pickle file format

combined_data_new.to_pickle(os.path.join(path, 'Prepared Data', 'combined_data_new.pkl'))